In [3]:
# Import Dependancies
import pandas as pd
import numpy as np

import re

from sqlalchemy import create_engine
import psycopg2

from config import db_password

from path import Path

In [4]:
# Define data file directory
file_dir1 = '../Resources/refactored_data'
file_dir2 = '../Resources/weather'

In [5]:
# Create total fish count DataFrame
fish_df = pd.read_csv(f'{file_dir1}/total_data.csv', low_memory=False)
fish_df.head()

,Count_Id,Year_Wk,Year,Month,Week_Number,Project,Date,Chinook Run,Chin,JChin,...,WStlhd,Sock,Coho,JCoho,Shad,Lmpry,BTrout,Chum,Pink,TempC
0,19900315,1990_11,1990,3,11,Bonneville,3/15/1990,Sp,2.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6.7
1,19900316,1990_11,1990,3,11,Bonneville,3/16/1990,Sp,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,7.2
2,19900317,1990_11,1990,3,11,Bonneville,3/17/1990,Sp,2.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6.7
3,19900318,1990_12,1990,3,12,Bonneville,3/18/1990,Sp,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,7.2
4,19900319,1990_12,1990,3,12,Bonneville,3/19/1990,Sp,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,7.8

In [6]:
# Convert TempC, Celcius values into TempF, Fahrenheit values
fish_df['TempF'] = fish_df['TempC'] * (9/5) + 32
fish_df.head()

,Count_Id,Year_Wk,Year,Month,Week_Number,Project,Date,Chinook Run,Chin,JChin,...,Sock,Coho,JCoho,Shad,Lmpry,BTrout,Chum,Pink,TempC,TempF
0,19900315,1990_11,1990,3,11,Bonneville,3/15/1990,Sp,2.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6.7,44.06
1,19900316,1990_11,1990,3,11,Bonneville,3/16/1990,Sp,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,7.2,44.96
2,19900317,1990_11,1990,3,11,Bonneville,3/17/1990,Sp,2.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6.7,44.06
3,19900318,1990_12,1990,3,12,Bonneville,3/18/1990,Sp,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,7.2,44.96
4,19900319,1990_12,1990,3,12,Bonneville,3/19/1990,Sp,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,7.8,46.04

In [7]:
# Drop columns that are not used
fish_df.drop(['Chinook Run','JChin','WStlhd','JCoho','Lmpry','BTrout','Chum','Pink','TempC'], axis=1, inplace=True)
fish_df.head()

,Count_Id,Year_Wk,Year,Month,Week_Number,Project,Date,Chin,Stlhd,Sock,Coho,Shad,TempF
0,19900315,1990_11,1990,3,11,Bonneville,3/15/1990,2.0,27.0,NaN,NaN,NaN,44.06
1,19900316,1990_11,1990,3,11,Bonneville,3/16/1990,1.0,44.0,NaN,NaN,NaN,44.96
2,19900317,1990_11,1990,3,11,Bonneville,3/17/1990,2.0,36.0,NaN,NaN,NaN,44.06
3,19900318,1990_12,1990,3,12,Bonneville,3/18/1990,1.0,60.0,NaN,NaN,NaN,44.96
4,19900319,1990_12,1990,3,12,Bonneville,3/19/1990,NaN,46.0,NaN,NaN,NaN,46.04

In [8]:
# Create weather data DataFrame
weather_df = pd.read_csv(f'{file_dir2}/bonWeather.csv', low_memory=False)
weather_df.head()

,Count_Id,Year_Wk,Year,Month,Week_Number,Project,Date,TMAX (Degrees Fahrenheit),TMIN (Degrees Fahrenheit),PRCP (Inches)
0,19900101,1990_01,1990,1,1,Bonneville,1/1/1990,49.0,35.0,0.89
1,19900102,1990_01,1990,1,1,Bonneville,1/2/1990,45.0,36.0,0.85
2,19900103,1990_01,1990,1,1,Bonneville,1/3/1990,46.0,39.0,0.02
3,19900104,1990_01,1990,1,1,Bonneville,1/4/1990,49.0,42.0,0.04
4,19900105,1990_01,1990,1,1,Bonneville,1/5/1990,53.0,45.0,0.47

In [9]:
# Define file path to save the fish count data
filepath = Path(f'{file_dir1}/fish_count.csv')

In [10]:
# Save the fish data as a CSV file
fish_df.to_csv(filepath,index=False)

In [9]:
# Setting up the database connection
db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5432/fish_count"
engine = create_engine(db_string)

In [10]:
# Read table combineddata from fish_count database
combined_df = pd.read_sql_table(table_name='combineddata2', con=engine)
combined_df.head()

,countid,yearvalue,monthvalue,weeknumber,locationname,daterecorded,maxtempf,mintempf,precipitationinch,watertempf,stlheadcount
0,19900101,1990,1,1,Bonneville,1990-01-01,49.0,35.0,0.89,NaN,NaN
1,19900102,1990,1,1,Bonneville,1990-01-02,45.0,36.0,0.85,NaN,NaN
2,19900103,1990,1,1,Bonneville,1990-01-03,46.0,39.0,0.02,NaN,NaN
3,19900104,1990,1,1,Bonneville,1990-01-04,49.0,42.0,0.04,NaN,NaN
4,19900105,1990,1,1,Bonneville,1990-01-05,53.0,45.0,0.47,NaN,NaN

In [11]:
# Define a file path to save the combined data file
filepath1 = Path(f'{file_dir1}/combineddata2.csv')

In [12]:
# Save the combined data as a CSV file
combined_df.to_csv(filepath1,index=False)